Autodesk.Revit.DB.ReferenceUtils.GetAnnotatedSteelFabElemsFromDoc(Autodesk.Revit.DB.Document,System.Collections.Generic.IDictionary{Autodesk.Revit.DB.ElementId,System.Int32}@,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId}@,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId}@)
Returns element ids for structural steel elements that have annotation references on them.
and dimensions at beam/column ends that need to be transferred to system line/level references.
doc:
Revit document.
dimsWithSteelFabRefs:
Map containing the dimension id and the LoD of the graphics it referenced - 0 Fine/1 Medium
steelAnnotatedElements:
Set of steel fabrication elements with dimension references on them
elementsWithDimsToTransfer:
Set of beam/column element IDs that have dimensions at their ends which need to be transferred on the system line/levels
driving beams/columns or slanted columns ends
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ReferenceUtils.UpdateGeomTagsFromReferences(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IDictionary{Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.BeamMatchedTags},System.Boolean)
Iterate through the references of the input object and update geometry tags
for any references pointing to beams in the provided dictionary
doc:
Revit document.
dimId:
dimension id
beamTagMatches:
dictionary mapping beam ElementIds to their face/edge tag
updateFineLoD:
whether to update fine or medium LoD tags
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ReferenceUtils.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ReferenceUtils
This is an utility class used for helper functions needed
to manage references between elements and update geometry tags
Since:
2027